import SwiftUI

final class StoriesStabData: ObservableObject {
    
    static let shared = StoriesStabData()
    
    @Published var stories: [Story] = [
        Story(small: .preview1,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big11,
                                   title: """
                                                    Пожелания дорогому Яндекс.Практикуму
                                                    от всей душы!!! Это самая лучшая 
                                                    платформа для обучения!  
                                                    """,
                                   description: """
                                                    Привет, практикум! Дорогой практикум
                                                    я очень тебе благодарен что ты меня
                                                    научил программировать на SwiftUI!
                                                    """),
                      ContentStory(big: .big12,
                                   title: """
                                                    Пожелания дорогому Яндекс.Практикуму
                                                    от всей душы!!! Это самая лучшая 
                                                    платформа для обучения!   
                                                    """,
                                   description: """
                                                    Привет, практикум! Дорогой практикум
                                                    я очень тебе благодарен что ты меня
                                                    научил программировать на SwiftUI!
                                                    """),
                      ContentStory(big: .big13,
                                   title: """
                                                    Пожелания дорогому Яндекс.Практикуму
                                                    от всей душы!!! Это самая лучшая 
                                                    платформа для обучения!   
                                                    """,
                                   description: """
                                                    Привет, практикум! Дорогой практикум
                                                    я очень тебе благодарен что ты меня
                                                    научил программировать на SwiftUI!
                                                    """)]),
        Story(small: .preview2,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big21,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big22,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big23,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
        Story(small: .preview3,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big31,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big32,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big33,
                                   title: """
                                                    Пожелания дорогому Яндекс.Практикуму
                                                    от всей душы!!! Это самая лучшая 
                                                    платформа для обучения!   
                                                    """,
                                   description: """
                                                    Привет, практикум! Дорогой практикум
                                                    я очень тебе благодарен что ты меня
                                                    научил программировать на SwiftUI!
                                                    """)]),
        Story(small: .preview4,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big41,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big42,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
        Story(small: .preview5,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big51,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big52,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
        Story(small: .preview6,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big61,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big62,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
        Story(small: .preview7,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big71,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big72,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
        Story(small: .preview8,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big81,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big82,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
        Story(small: .preview9,
              title: """
                    Яндекс.Практикум
                    это лучшая онлайн-школа
                    """,
              isViewed: false,
              story: [ContentStory(big: .big91,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """),
                      ContentStory(big: .big92,
                                   title: """
                                                     Пожелания дорогому Яндекс.Практикуму
                                                     от всей душы!!! Это самая лучшая 
                                                     платформа для обучения!   
                                                     """,
                                   description: """
                                                     Привет, практикум! Дорогой практикум
                                                     я очень тебе благодарен что ты меня
                                                     научил программировать на SwiftUI!
                                                     """)]),
    ]
}


